In [2]:
# Import Dependencies
import pandas as pd

In [3]:
raw_data = {
    'Class': ['Oct', 'Oct', 'Jan', 'Jan', 'Oct', 'Jan'], 
    'Name': ["Cyndy", "Logan", "Laci", "Elmer", "Crystle", "Emmie"], 
    'Test Score': [90, 59, 72, 88, 98, 60]}
df = pd.DataFrame(raw_data)
df

  Class     Name  Test Score
0   Oct    Cyndy          90
1   Oct    Logan          59
2   Jan     Laci          72
3   Jan    Elmer          88
4   Oct  Crystle          98
5   Jan    Emmie          60

In [9]:
df['bins'] = pd.cut(df['Test Score'],[0,59,69,79,89,100],)
df

  Class     Name  Test Score       bins
0   Oct    Cyndy          90  (89, 100]
1   Oct    Logan          59    (0, 59]
2   Jan     Laci          72   (69, 79]
3   Jan    Elmer          88   (79, 89]
4   Oct  Crystle          98  (89, 100]
5   Jan    Emmie          60   (59, 69]

In [14]:
bins = [0,59,69,79,89,100]
bin_labels = ["F","D","C","B","A"]
df['Grade'] = pd.cut(df['Test Score'],bins,labels=bin_labels)
df

  Class     Name  Test Score       bins Grade
0   Oct    Cyndy          90  (89, 100]     A
1   Oct    Logan          59    (0, 59]     F
2   Jan     Laci          72   (69, 79]     C
3   Jan    Elmer          88   (79, 89]     B
4   Oct  Crystle          98  (89, 100]     A
5   Jan    Emmie          60   (59, 69]     D

In [19]:
df = df.sort_values(["Grade",'Test Score'], ascending=False)

In [25]:
df.groupby('Grade')['Name'].count()

Grade
F    1
D    1
C    1
B    1
A    2
Name: Name, dtype: int64